Revit 2024 API
Application.LinkedResourceOpening Event
 Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public event EventHandler<LinkedResourceOpeningEventArgs> LinkedResourceOpening
Visual Basic
Public Event LinkedResourceOpening As EventHandler(Of LinkedResourceOpeningEventArgs)
Visual C++
public:
 event EventHandler<LinkedResourceOpeningEventArgs^>^ LinkedResourceOpening {
	void add (EventHandler<LinkedResourceOpeningEventArgs^>^ value);
	void remove (EventHandler<LinkedResourceOpeningEventArgs^>^ value);
}
Remarks
This event is raised when Revit is just about to open a linked resource. Only supports linked resources for following types : Revit; IFC; CAD(dwg, dxf, dgn, sat); This event would not be raised if there are no update on linked CAD, IFC resources.
Event is not cancellable.
The linked resource cannot be modified, for it is not opened yet at the time of the event.
Another LinkedResourceOpened event will be raised immediately after linked resource is opened.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace